{
    "architectures": [
        "LLaDAModelLM"
    ],
    "auto_map": {
        "AutoConfig": "configuration_llada.LLaDAConfig",
        "AutoModelForCausalLM": "modeling_llada.LLaDAModelLM",
        "AutoModel": "modeling_llada.LLaDAModelLM"
    },
    "attention_bias": false,
    "attention_dropout": 0.0,
    "bos_token_id": 128000,
    "eos_token_id": 126081,
    "hidden_act": "silu",
    "hidden_size": 4096,
    "initializer_range": 0.02,
    "intermediate_size": 12288,
    "max_position_embeddings": 16384,
    "model_type": "llada",
    "num_attention_heads": 32,
    "num_hidden_layers": 32,
    "num_key_value_heads": 32,
    "pretraining_tp": 1,
    "rms_norm_eps": 1e-05,
    "rope_scaling": null,
    "rope_theta": 500000.0,
    "tie_word_embeddings": false,
    "torch_dtype": "bfloat16",
    "transformers_version": "4.39.1",
    "use_cache": false,
    "vocab_size": 126464
}
